Reports/ДиагностикаЭтапаПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Report>
		<Properties>
			<Name>ДиагностикаЭтапаПроизводства</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ГрафикЭтаповПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ГрафикЭтаповПроизводства2_2</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачалоЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеПредварительногоБуфера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоЗавершающегоБуфера</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоСледующегоЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаКритическомПути</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничиваетСрокВыпуска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграниченПоМатериалам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграниченПоОборудованию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РазмещениеВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПривязкиОперацийПроизводства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусГрафика</Name>
					<Comment>Служебный реквизит. Статус 0 - рабочий ("боевой") график; статус 1 - предварительный график (рассчитан но не сохранен); статус 2 - модель графика.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ДоступностьВидовРабочихЦентров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ДоступностьВидовРабочихЦентров</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Занято</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступностьПоВидуРЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступностьПоРЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЗанятоСозданнымМЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДоступность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяДоступностьПоВидуРЦ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтрокиПродукция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСтрокиЭтапыГрафик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНаладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНаладки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДвижениеВводаДоступности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДвижениеЗаказаНаПроизводство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДвижениеМаршрутногоЛиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИнтервала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ПланированиеЗагрузкиВидовРабочихЦентров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ПланированиеЗагрузкиВидовРабочихЦентров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Занято</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусГрафика</Name>
					<Comment>Служебный реквизит. Статус 0 - рабочий ("боевой") график; статус 1 - предварительный график (рассчитан но не сохранен); статус 2 - модель графика.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаИнтервала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НормативныйГрафикЭтаповПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>НормативныйГрафикЭтаповПроизводства</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ресурсоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьДоВыпуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьДоЗапуска</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЭтапыСНулевойДлительностьюУпорядочены</Name>
					<Comment>Служебный реквизит, необходимый для обновления регистра</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭтапПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыЭтаповПроизводства2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СтатусыЭтаповПроизводства2_2</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Формируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Секунда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сутки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыПривязкиОперацийПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>СпособыПривязкиОперацийПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КНачалу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОкончанию</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТочностьГрафикаПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТочностьГрафикаПроизводства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ДиагностикаЭтапаПроизводства/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует отчет.
//
// Параметры:
//  Параметры  - Структура - параметры формирования отчета.
//		* ЭтапПроизводства - ДокументСсылка.ЭтапПроизводства2_2 - диагностируемый этап.
//		* СтатусГрафика - Число - статус диагностируемого графика.
//  АдресХранилища - Строка - адрес хранилища, в которое будет помещен результат формирования отчета.
//
Процедура СформироватьОтчет(Параметры, АдресХранилища) Экспорт
	
	ТабличныйДокумент = Параметры.ТабличныйДокумент;
	ТабличныйДокумент.Очистить();
	РасшифровкиАльтернатив = Новый Массив;
	
	ДанныеЭтапа = ДанныеЭтапа(Параметры.ЭтапПроизводства, Параметры.СтатусГрафика);
	МакетОформления = Отчеты.ДиагностикаЭтапаПроизводства.ПолучитьМакет("ДиагностикаЭтапа");
	
	Если ДанныеЭтапа <> Неопределено Тогда
		
		ВывестиШапку(ТабличныйДокумент, ДанныеЭтапа, МакетОформления);
		
		ВывестиСмежныеЭтапы(ТабличныйДокумент, ДанныеЭтапа, МакетОформления);
		ВывестиЛевуюГраницу(ТабличныйДокумент, ДанныеЭтапа, МакетОформления);
		
		ВывестиИсполнителей(ТабличныйДокумент, ДанныеЭтапа, МакетОформления, РасшифровкиАльтернатив);
		ВывестиМатериалы(ТабличныйДокумент, ДанныеЭтапа, МакетОформления);
		
		ОбвестиГраницыЭтапа(ТабличныйДокумент, ДанныеЭтапа);
		
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ТабличныйДокумент", ТабличныйДокумент);
	Результат.Вставить("РасшифровкиАльтернатив", РасшифровкиАльтернатив);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СмежныеЭтапы

Процедура ВывестиСмежныеЭтапы(ТабличныйДокумент, ДанныеЭтапа, МакетОформления)
	
	ОбластьЗаголовок = МакетОформления.ПолучитьОбласть("СмежныеЭтапыЗаголовок");
	Если ДанныеЭтапа.РазмещениеКНачалу Тогда
		ОбластьЗаголовок.Область("R1C1").Текст = НСтр("ru = 'Предшественники'");
	Иначе
		ОбластьЗаголовок.Область("R1C1").Текст = НСтр("ru = 'Последователи'");
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Оформления = ОформленияИсполнители(МакетОформления);
	
	ОбластьЭтап = МакетОформления.ПолучитьОбласть("Этап");
	ОбластьЭтапДанные = МакетОформления.ПолучитьОбласть("ЭтапДанные");
	ОбластьИнтервалЗанят    = МакетОформления.ПолучитьОбласть("ИнтервалЗанят");
	ОбластьИнтервалДоступен = МакетОформления.ПолучитьОбласть("ИнтервалДоступен");
	
	Этапы = СмежныеЭтапы(ДанныеЭтапа);
	Для каждого Этап Из Этапы Цикл
		
		ОбластьЭтап.Параметры.ЭтапПроизводства = Этап.ЭтапПроизводства;
		ОбластьЭтап.Параметры.ПредставлениеЭтапа = Этап.ПредставлениеЭтапа;
		ТабличныйДокумент.Вывести(ОбластьЭтап);
		
		Начало = ДанныеЭтапа.ПолныйИнтервалНачало;
		Пока Начало < ДанныеЭтапа.ПолныйИнтервалОкончание Цикл
			
			Если ДанныеЭтапа.РазмещениеКНачалу Тогда
				
				Если Начало < Этап.ОкончаниеЭтапа Тогда
					УстановитьОформлениеОбласти(ОбластьЭтапДанные.Области.ЭтапДанные, Оформления.ИнтервалЗанят);
				Иначе
					УстановитьОформлениеОбласти(ОбластьЭтапДанные.Области.ЭтапДанные, Оформления.ИнтервалДоступен);
				КонецЕсли;
				
			Иначе
				
				Окончание = ПривестиКОкончаниюИнтервалаПланирования(ДанныеЭтапа, Начало) - 1;
				Если Окончание >= Этап.НачалоЭтапа И ЗначениеЗаполнено(Этап.НачалоЭтапа) Тогда
					УстановитьОформлениеОбласти(ОбластьЭтапДанные.Области.ЭтапДанные, Оформления.ИнтервалЗанят);
				Иначе
					УстановитьОформлениеОбласти(ОбластьЭтапДанные.Области.ЭтапДанные, Оформления.ИнтервалДоступен);
				КонецЕсли;
				
			КонецЕсли;
			
			ДобавленнаяОбласть = ТабличныйДокумент.Присоединить(ОбластьЭтапДанные);
			
			Расшифровка = Новый Структура;
			Расшифровка.Вставить("ВидОбласти", "ОткрытьДиагностикуСмежногоЭтапа");
			Расшифровка.Вставить("ЭтапПроизводства", Этап.ЭтапПроизводства);
			ДобавленнаяОбласть.Расшифровка = Расшифровка;
			
			Начало = ПривестиКОкончаниюИнтервалаПланирования(ДанныеЭтапа, Начало);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция СмежныеЭтапы(ДанныеЭтапа)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Документы.ЭтапПроизводства2_2.СоздатьВТСвязиЭтапов(
		МенеджерВременныхТаблиц,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеЭтапа.ЭтапПроизводства),
		Ложь);
	
	ТекстыЗапросовПакета = Новый Массив;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТСвязиЭтапов.&СмежныйЭтап КАК ЭтапПроизводства
	|ПОМЕСТИТЬ ВТЭтапы
	|ИЗ
	|	ВТСвязиЭтапов КАК ВТСвязиЭтапов
	|ГДЕ
	|	ВТСвязиЭтапов.&ТекущийЭтап = &ЭтапПроизводства
	|	И ВТСвязиЭтапов.&СмежныйЭтап.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЭтаповПроизводства2_2.Завершен)";
	ТекстыЗапросовПакета.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = РегистрыСведений.ГрафикЭтаповПроизводства2_2.ТекстЗапросаВТСрокиВыполненияЭтапов(
		"ВТЭтапы", "ЭтапПроизводства");
	ТекстыЗапросовПакета.Добавить(ТекстЗапроса);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Этапы.ЭтапПроизводства КАК ЭтапПроизводства,
	|	&ПредставлениеЭтапа КАК ПредставлениеЭтапа,
	|	ЕСТЬNULL(СрокиВыполнения.НачалоЭтапа, ДАТАВРЕМЯ(1, 1, 1)) КАК НачалоЭтапа,
	|	ЕСТЬNULL(СрокиВыполнения.ОкончаниеЭтапа, ДАТАВРЕМЯ(1, 1, 1)) КАК ОкончаниеЭтапа
	|ИЗ
	|	ВТЭтапы КАК Этапы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТСрокиВыполненияЭтапов КАК СрокиВыполнения
	|		ПО Этапы.ЭтапПроизводства = СрокиВыполнения.ЭтапПроизводства
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоЭтапа,
	|	ОкончаниеЭтапа";
	ТекстыЗапросовПакета.Добавить(ТекстЗапроса);
	
	Разделитель =
	"
	|;
	|/////////////////////////////////////////////////////////////
	|";
	ТекстЗапроса = СтрСоединить(ТекстыЗапросовПакета, Разделитель);
	
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПредставлениеЭтапа",
		Документы.ЭтапПроизводства2_2.ТекстЗапросаПредставлениеЭтапа("Этапы.ЭтапПроизводства"));
		
	Если ДанныеЭтапа.РазмещениеКНачалу Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СмежныйЭтап", "Этап");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекущийЭтап", "СледующийЭтап");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&СмежныйЭтап", "СледующийЭтап");
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТекущийЭтап", "Этап");
	КонецЕсли;

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ЭтапПроизводства", ДанныеЭтапа.ЭтапПроизводства);
	Запрос.УстановитьПараметр("СтатусГрафика", ДанныеЭтапа.СтатусГрафика);
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область Исполнители

Процедура ВывестиИсполнителей(ТабличныйДокумент, ДанныеЭтапа, МакетОформления, РасшифровкиАльтернатив)
	
	ВывестиЗаголовокИсполнители(ТабличныйДокумент, ДанныеЭтапа, МакетОформления);
	
	Если ЭтоЭтапУББВ(ДанныеЭтапа) Тогда
		
		ВывестиРасписаниеПодразделения(ТабличныйДокумент, ДанныеЭтапа, МакетОформления);
		
	Иначе
		
		Исполнители = ИсполнителиЭтапа(ДанныеЭтапа);
		
		Если Исполнители.Количество() > 0 Тогда
			
			ГрафикИсполнителей = ГрафикИсполнителей(ДанныеЭтапа, Исполнители);
			
			Для каждого Исполнитель Из Исполнители Цикл
				
				Если НЕ Исполнитель.Альтернативный Тогда
					
					ВывестиИсполнителя(ТабличныйДокумент, ДанныеЭтапа, Исполнитель, Исполнители, ГрафикИсполнителей, МакетОформления, РасшифровкиАльтернатив);
					
				КонецЕсли;
			    	
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиЗаголовокИсполнители(ТабличныйДокумент, ДанныеЭтапа, МакетОформления)
	
	ОбластьЗаголовок = МакетОформления.ПолучитьОбласть("ДоступностьВидовРабочихЦентровЗаголовок");
	
	Если ЭтоЭтапУББВ(ДанныеЭтапа) Тогда
		ЗаголовокИсполнители = НСтр("ru = 'Доступность подразделения'");
	Иначе
		ЗаголовокИсполнители = НСтр("ru = 'Доступность видов рабочих центров'");
	КонецЕсли;
	
	ОбластьЗаголовок.Параметры.ЗаголовокИсполнители = ЗаголовокИсполнители;
	
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
КонецПроцедуры

Процедура ВывестиРасписаниеПодразделения(ТабличныйДокумент, ДанныеЭтапа, МакетОформления)
	
	// Вывод заголовка.
	ОбластьЗаголовок = МакетОформления.ПолучитьОбласть("Исполнитель");
	ОбластьЗаголовок.Параметры.Исполнитель = ДанныеЭтапа.Подразделение;
	ОбластьЗаголовок.Параметры.Требуется = ПолучитьВремяСтрокой(
		ДанныеЭтапа.ДлительностьЭтапа, ДанныеЭтапа.ЕдиницаИзмеренияДлительностиЭтапа);
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	// Вывод расписания.
	ОбластьИсполнительНетДоступности = МакетОформления.ПолучитьОбласть("ИсполнительДанные");
	ОбластьИсполнительЕстьДоступность = МакетОформления.ПолучитьОбласть("ИсполнительДанныеБезОграниченияДоступности");
	
	Оформления = ОформленияИсполнители(МакетОформления);
	
	Расписание = РасписаниеПодразделения(ДанныеЭтапа);
	СтруктураПоиска = Новый Структура("ГрафикРаботы, ДатаГрафика", ДанныеЭтапа.ГрафикРаботы);
	
	Начало = ДанныеЭтапа.ПолныйИнтервалНачало;
	Пока Начало < ДанныеЭтапа.ПолныйИнтервалОкончание Цикл
		
		Окончание = ПривестиКОкончаниюИнтервалаПланирования(ДанныеЭтапа, Начало);
		
		СтруктураПоиска.ДатаГрафика = Начало;
		НайденныеСтроки = Расписание.НайтиСтроки(СтруктураПоиска);
		
		ИнтервалЗанят = Ложь;
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			ОбластьДанные = ОбластьИсполнительНетДоступности;
			
			УстановитьОформлениеОбласти(
				ОбластьДанные.Области.ИсполнительДанные,
				Оформления.ИнтервалНедоступен);
			
		Иначе
			
			ОбластьДанные = ОбластьИсполнительЕстьДоступность;
			
			Если (ДанныеЭтапа.НачалоЭтапа >= Начало И ДанныеЭтапа.НачалоЭтапа < Окончание)
				ИЛИ (Начало >= ДанныеЭтапа.НачалоЭтапа И Начало < ДанныеЭтапа.ОкончаниеЭтапа) Тогда
				
				Оформление = Оформления.ИнтервалЗанятДиагностируемымЭтапом;
				ИнтервалЗанят = Истина;
				
			Иначе
				
				Оформление = Оформления.ИнтервалДоступен;
				
			КонецЕсли;
			
			УстановитьОформлениеОбласти(
				ОбластьДанные.Области.ИсполнительДанныеБезОграниченияДоступности,
				Оформление);
			
		КонецЕсли;
		
		ДобавленнаяОбласть = ТабличныйДокумент.Присоединить(ОбластьДанные);
		
		Если ИнтервалЗанят Тогда
			ЗаполнитьГраницыЭтапа(ДанныеЭтапа, ДобавленнаяОбласть);
		КонецЕсли;
		
	    Начало = Окончание;
		
	КонецЦикла;
	
КонецПроцедуры

Функция РасписаниеПодразделения(ДанныеЭтапа)
	
	Графики = Новый Массив;
	Графики.Добавить(ДанныеЭтапа.ГрафикРаботы);
	
	Результат = Обработки.ПланированиеГрафикаПроизводства2_2.РасписаниеУББВ(
		Графики, ДанныеЭтапа.ПолныйИнтервалНачало, ДанныеЭтапа.ПолныйИнтервалОкончание);
	Результат.Индексы.Добавить("ГрафикРаботы, ДатаГрафика");
	
	Возврат Результат;
	
КонецФункции

Функция ИсполнителиЭтапа(ДанныеЭтапа)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка КАК ЭтапПроизводства,
	|	ЭтапПроизводства2_2ВидыРабочихЦентров.ВидРабочегоЦентра,
	|	ЭтапПроизводства2_2ВидыРабочихЦентров.ВремяРаботы,
	|	ЭтапПроизводства2_2ВидыРабочихЦентров.ЕдиницаИзмерения,
	|	ЭтапПроизводства2_2ВидыРабочихЦентров.КлючСвязи КАК КлючСвязи,
	|	ЭтапПроизводства2_2ВидыРабочихЦентров.Использовать,
	|	ЭтапПроизводства2_2ВидыРабочихЦентров.НомерСтроки
	|ПОМЕСТИТЬ ВТИсполнители
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВидыРабочихЦентров КАК ЭтапПроизводства2_2ВидыРабочихЦентров
	|ГДЕ
	|	ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка = &ЭтапПроизводства
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.Ссылка,
	|	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.ВидРабочегоЦентра,
	|	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.ВремяРаботы,
	|	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.ЕдиницаИзмерения,
	|	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.КлючСвязиВидыРабочихЦентров,
	|	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.Использовать,
	|	ЕСТЬNULL(ЭтапПроизводства2_2ВидыРабочихЦентров.НомерСтроки, 0)
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.АльтернативныеВидыРабочихЦентров КАК ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВидыРабочихЦентров КАК ЭтапПроизводства2_2ВидыРабочихЦентров
	|		ПО ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.Ссылка = ЭтапПроизводства2_2ВидыРабочихЦентров.Ссылка
	|			И ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.КлючСвязиВидыРабочихЦентров = ЭтапПроизводства2_2ВидыРабочихЦентров.КлючСвязи
	|ГДЕ
	|	ЭтапПроизводства2_2АльтернативныеВидыРабочихЦентров.Ссылка = &ЭтапПроизводства
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТИсполнители.ВидРабочегоЦентра,
	|	ВТИсполнители.ВремяРаботы,
	|	ВТИсполнители.ЕдиницаИзмерения,
	|	ВТИсполнители.КлючСвязи,
	|	ВТИсполнители.ВидРабочегоЦентра.УчитыватьДоступностьПоГрафикуРаботы КАК УчитыватьДоступность,
	|	ВТИсполнители.ЭтапПроизводства.Подразделение.ИнтервалПланирования КАК ИнтервалПланирования,
	|	НЕ ВТИсполнители.Использовать КАК Альтернативный,
	|	ВЫБОР
	|		КОГДА ВТИсполнители.ВидРабочегоЦентра.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТИсполнители.ВидРабочегоЦентра.Подразделение.ГрафикРаботы = ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
	|						ТОГДА ОсновнойКалендарьПредприятия.Значение
	|					ИНАЧЕ ВТИсполнители.ВидРабочегоЦентра.Подразделение.ГрафикРаботы
	|				КОНЕЦ
	|		ИНАЧЕ ВТИсполнители.ВидРабочегоЦентра.Календарь
	|	КОНЕЦ КАК ГрафикРаботы
	|ИЗ
	|	ВТИсполнители КАК ВТИсполнители
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ОсновнойКалендарьПредприятия КАК ОсновнойКалендарьПредприятия
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТИсполнители.НомерСтроки");
	
	Запрос.УстановитьПараметр("ЭтапПроизводства", ДанныеЭтапа.ЭтапПроизводства);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ГрафикИсполнителей(ДанныеЭтапа, Исполнители)
	
	Результат = Новый Структура;
	
	Результат.Вставить("РасписаниеББВ", РасписаниеББВ(ДанныеЭтапа, Исполнители));
	Результат.Вставить("ЗагрузкаВРЦБезОграничений", ЗагрузкаВРЦБезОграничений(ДанныеЭтапа, Исполнители));
	Результат.Вставить("ДоступностьВРЦ", ДоступностьВРЦ(ДанныеЭтапа, Исполнители));
	
	Возврат Результат;
	
КонецФункции

Функция РасписаниеББВ(ДанныеЭтапа, Исполнители)
	
	Графики = Новый ТаблицаЗначений;
	Графики.Колонки.Добавить("ГрафикРаботы", Новый ОписаниеТипов("СправочникСсылка.Календари"));
	Графики.Колонки.Добавить("ИнтервалПланирования",
		Новый ОписаниеТипов("ПеречислениеСсылка.ТочностьГрафикаПроизводства"));
	
	Для каждого Исполнитель Из Исполнители Цикл
		Если НЕ Исполнитель.УчитыватьДоступность Тогда
			
			НоваяСтрока = Графики.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Исполнитель);
			
		КонецЕсли;
	КонецЦикла;
	
	Если Графики.Количество() > 0 Тогда
		
		Графики.Свернуть("ГрафикРаботы, ИнтервалПланирования");
		
		Результат = Обработки.ПланированиеГрафикаПроизводства2_2.РасписаниеББВ(
			Графики, ДанныеЭтапа.ПолныйИнтервалНачало, ДанныеЭтапа.ПолныйИнтервалОкончание);
		Результат.Индексы.Добавить("ГрафикРаботы, ИнтервалПланирования, ДатаИнтервала");
			
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузкаВРЦБезОграничений(ДанныеЭтапа, Исполнители)
	
	ВРЦБезОграничений = Новый Массив;
	Для каждого Исполнитель Из Исполнители Цикл
		Если НЕ Исполнитель.УчитыватьДоступность Тогда
			ВРЦБезОграничений.Добавить(Исполнитель.ВидРабочегоЦентра);
		КонецЕсли;
	КонецЦикла;
	
	Если ВРЦБезОграничений.Количество() > 0 Тогда
		
		Если ДанныеЭтапа.СтатусГрафика = СтатусРабочийГрафик() Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ДоступностьВидовРабочихЦентровОбороты.ВидРабочегоЦентра,
			|	ДоступностьВидовРабочихЦентровОбороты.ДатаИнтервала,
			|	СУММА(ВЫБОР
			|			КОГДА ДоступностьВидовРабочихЦентровОбороты.Регистратор = &ЭтапПроизводства
			|				ТОГДА ДоступностьВидовРабочихЦентровОбороты.ЗанятоОборот
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ЗанятоТекущим
			|ИЗ
			|	РегистрНакопления.ДоступностьВидовРабочихЦентров.Обороты(
			|			,
			|			,
			|			Регистратор,
			|			ВидРабочегоЦентра В (&ВидыРабочихЦентров)
			|				И (ДатаИнтервала МЕЖДУ &Начало И &Окончание)) КАК ДоступностьВидовРабочихЦентровОбороты
			|
			|СГРУППИРОВАТЬ ПО
			|	ДоступностьВидовРабочихЦентровОбороты.ВидРабочегоЦентра,
			|	ДоступностьВидовРабочихЦентровОбороты.ДатаИнтервала";
			
		Иначе
			
			ТекстЗапроса =
			"ВЫБРАТЬ
			|	ПланированиеЗагрузкиВидовРабочихЦентров.ВидРабочегоЦентра,
			|	ПланированиеЗагрузкиВидовРабочихЦентров.ДатаИнтервала,
			|	СУММА(ВЫБОР
			|			КОГДА ПланированиеЗагрузкиВидовРабочихЦентров.ЭтапПроизводства = &ЭтапПроизводства
			|				ТОГДА ПланированиеЗагрузкиВидовРабочихЦентров.Занято
			|			ИНАЧЕ 0
			|		КОНЕЦ) КАК ЗанятоТекущим
			|ИЗ
			|	РегистрСведений.ПланированиеЗагрузкиВидовРабочихЦентров КАК ПланированиеЗагрузкиВидовРабочихЦентров
			|ГДЕ
			|	ПланированиеЗагрузкиВидовРабочихЦентров.СтатусГрафика = &СтатусГрафика
			|	И ПланированиеЗагрузкиВидовРабочихЦентров.ВидРабочегоЦентра В(&ВидыРабочихЦентров)
			|	И ПланированиеЗагрузкиВидовРабочихЦентров.ДатаИнтервала МЕЖДУ &Начало И &Окончание
			|
			|СГРУППИРОВАТЬ ПО
			|	ПланированиеЗагрузкиВидовРабочихЦентров.ВидРабочегоЦентра,
			|	ПланированиеЗагрузкиВидовРабочихЦентров.ДатаИнтервала";
			
		КонецЕсли;
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("СтатусГрафика", ДанныеЭтапа.СтатусГрафика);
		Запрос.УстановитьПараметр("ВидыРабочихЦентров", ВРЦБезОграничений);
		Запрос.УстановитьПараметр("Начало", ДанныеЭтапа.ПолныйИнтервалНачало);
		Запрос.УстановитьПараметр("Окончание", ДанныеЭтапа.ПолныйИнтервалОкончание);
		Запрос.УстановитьПараметр("ЭтапПроизводства", ДанныеЭтапа.ЭтапПроизводства);
		
		Результат = Запрос.Выполнить().Выгрузить();
		Результат.Индексы.Добавить("ВидРабочегоЦентра, ДатаИнтервала");
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДоступностьВРЦ(ДанныеЭтапа, Исполнители)
	
	МассивВРЦ = Новый Массив;
	Для каждого Исполнитель Из Исполнители Цикл
		Если Исполнитель.УчитыватьДоступность Тогда
			МассивВРЦ.Добавить(Исполнитель.ВидРабочегоЦентра);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивВРЦ.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Распоряжение", ДанныеЭтапа.Распоряжение);
	Запрос.УстановитьПараметр("ЭтапПроизводства", ДанныеЭтапа.ЭтапПроизводства);
	Запрос.УстановитьПараметр("СтатусГрафика", ДанныеЭтапа.СтатусГрафика);
	
	МассивЭтапов = Новый Массив;
	СоздатьВТЗагрузкаРаспоряженияИЗаполнитьЭтапыИсключения(ДанныеЭтапа, Запрос, МассивЭтапов);
	
	Параметры = Новый Структура("Распоряжение, Очередь, ПриоритетНомер, ПодразделениеНомер");
	ЗаполнитьЗначенияСвойств(Параметры, ДанныеЭтапа);
	Параметры.Вставить("РазмещениеКНачалу", Ложь);
	Параметры.Вставить("ОтсутствиеПрочихЗаказов", Ложь);
	Параметры.Вставить("ОтменитьРучныеИзмененияГрафика", Ложь);
	
	Обработки.ПланированиеГрафикаПроизводства2_2.СоздатьВТДоступностьВидовРЦ(
		МенеджерВременныхТаблиц,
		"ВТДоступность",
		МассивВРЦ,
		МассивЭтапов,
		ДанныеЭтапа.ПолныйИнтервалНачало, 
		ДанныеЭтапа.ПолныйИнтервалОкончание,
		Параметры);
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВТДоступность.Исполнитель КАК ВидРабочегоЦентра,
	|	ВТДоступность.ДатаИнтервала,
	|	ЕСТЬNULL(ВТЗагрузкаРаспоряжения.ЗанятоТекущим, 0) КАК ЗанятоТекущим,
	|	ВТДоступность.КоличествоРасход + ЕСТЬNULL(ВТЗагрузкаРаспоряжения.ЗанятоПрочими, 0) КАК ЗанятоПрочими,
	|	ВТДоступность.КоличествоПриход - (ЕСТЬNULL(ВТЗагрузкаРаспоряжения.ЗанятоТекущим, 0) + ВТДоступность.КоличествоРасход + ЕСТЬNULL(ВТЗагрузкаРаспоряжения.ЗанятоПрочими, 0)) КАК СвободноСРезервом,
	|	ВТДоступность.КоличествоПриход КАК ОбщаяДоступность,
	|	ВЫРАЗИТЬ(&Резерв КАК ЧИСЛО(15, 0)) КАК РезервОбщий,
	|	&ДоступноДляТекущегоСРезервом КАК ДоступноДляТекущегоСРезервом,
	|	ВЫБОР
	|		КОГДА НЕ ВТДоступность.РезервДоступности = 0
	|			ТОГДА ВЫБОР
	|					КОГДА &Резерв <= &ДоступноДляТекущегоСРезервом
	|						ТОГДА ВЫРАЗИТЬ(&Резерв КАК ЧИСЛО(15, 0))
	|					ИНАЧЕ &ДоступноДляТекущегоСРезервом
	|				КОНЕЦ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК РезервДоступноДляТекущего
	
	|ИЗ
	|	ВТДоступность КАК ВТДоступность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТЗагрузкаРаспоряжения КАК ВТЗагрузкаРаспоряжения
	|		ПО ВТДоступность.Исполнитель = ВТЗагрузкаРаспоряжения.ВидРабочегоЦентра
	|			И ВТДоступность.ДатаИнтервала = ВТЗагрузкаРаспоряжения.ДатаИнтервала";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ДоступноДляТекущегоСРезервом",
		"ВТДоступность.КоличествоПриход - (ВТДоступность.КоличествоРасход + ЕСТЬNULL(ВТЗагрузкаРаспоряжения.ЗанятоПрочими, 0))");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Резерв",
		"ВТДоступность.КоличествоПриход * (ВТДоступность.РезервДоступности / 100)");
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Индексы.Добавить("ВидРабочегоЦентра, ДатаИнтервала");
	
	Возврат Результат;
	
КонецФункции

Процедура СоздатьВТЗагрузкаРаспоряженияИЗаполнитьЭтапыИсключения(ДанныеЭтапа, Запрос, ЭтапыИсключения)
	
	Если ДанныеЭтапа.СтатусГрафика = СтатусРабочийГрафик() Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоступностьВидовРабочихЦентровОбороты.ВидРабочегоЦентра КАК ВидРабочегоЦентра,
		|	ДоступностьВидовРабочихЦентровОбороты.ДатаИнтервала,
		|	СУММА(ДоступностьВидовРабочихЦентровОбороты.ЗанятоОборот) КАК ЗанятоТекущим,
		|	СУММА(0) КАК ЗанятоПрочими
		|ПОМЕСТИТЬ ВТЗагрузкаРаспоряжения
		|ИЗ
		|	РегистрНакопления.ДоступностьВидовРабочихЦентров.Обороты(, , Регистратор, ) КАК ДоступностьВидовРабочихЦентровОбороты
		|ГДЕ
		|	ДоступностьВидовРабочихЦентровОбороты.Регистратор = &ЭтапПроизводства
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступностьВидовРабочихЦентровОбороты.ВидРабочегоЦентра,
		|	ДоступностьВидовРабочихЦентровОбороты.ДатаИнтервала";
		
		Запрос.Выполнить();
		
		ЭтапыИсключения.Добавить(ДанныеЭтапа.ЭтапПроизводства);
		
	Иначе
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПланированиеЗагрузкиВидовРабочихЦентров.ВидРабочегоЦентра,
		|	ПланированиеЗагрузкиВидовРабочихЦентров.ДатаИнтервала,
		|	ПланированиеЗагрузкиВидовРабочихЦентров.ЭтапПроизводства,
		|	ПланированиеЗагрузкиВидовРабочихЦентров.Занято
		|ПОМЕСТИТЬ ВТРезультатыПланирования
		|ИЗ
		|	РегистрСведений.ПланированиеЗагрузкиВидовРабочихЦентров КАК ПланированиеЗагрузкиВидовРабочихЦентров
		|ГДЕ
		|	ПланированиеЗагрузкиВидовРабочихЦентров.СтатусГрафика = &СтатусГрафика
		|	И ПланированиеЗагрузкиВидовРабочихЦентров.Распоряжение = &Распоряжение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРезультатыПланирования.ВидРабочегоЦентра,
		|	ВТРезультатыПланирования.ДатаИнтервала,
		|	СУММА(ВЫБОР
		|			КОГДА ВТРезультатыПланирования.ЭтапПроизводства = &ЭтапПроизводства
		|				ТОГДА ВТРезультатыПланирования.Занято
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЗанятоТекущим,
		|	СУММА(ВЫБОР
		|			КОГДА НЕ ВТРезультатыПланирования.ЭтапПроизводства = &ЭтапПроизводства
		|				ТОГДА ВТРезультатыПланирования.Занято
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ЗанятоПрочими
		|ПОМЕСТИТЬ ВТЗагрузкаРаспоряжения
		|ИЗ
		|	ВТРезультатыПланирования КАК ВТРезультатыПланирования
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТРезультатыПланирования.ВидРабочегоЦентра,
		|	ВТРезультатыПланирования.ДатаИнтервала
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТРезультатыПланирования.ЭтапПроизводства
		|ИЗ
		|	ВТРезультатыПланирования КАК ВТРезультатыПланирования";
		
		ЭтапыИсключения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЭтапПроизводства");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиИсполнителя(ТабличныйДокумент, ДанныеЭтапа, Исполнитель, Исполнители, ГрафикИсполнителей, МакетОформления, РасшифровкиАльтернатив)
	
	ВывестиЗаголовокИсполнитель(ТабличныйДокумент, Исполнитель, Исполнители, МакетОформления, РасшифровкиАльтернатив);
	
	Если Исполнитель.УчитыватьДоступность Тогда
		
		ВывестиДоступностьИсполнительСОграничениями(
			ТабличныйДокумент, ДанныеЭтапа, Исполнитель, ГрафикИсполнителей, МакетОформления);
		
	Иначе
		
		ВывестиДоступностьИсполнительБезОграничений(
			ТабличныйДокумент, ДанныеЭтапа, Исполнитель, ГрафикИсполнителей, МакетОформления);
			
	КонецЕсли;
	
	АльтернативныеИсполнители = АльтернативныеИсполнители(Исполнитель, Исполнители);
	Если НЕ АльтернативныеИсполнители = Неопределено Тогда
		
		ВысотаТаблицы = ТабличныйДокумент.ВысотаТаблицы;
		Для каждого АльтернативныйИсполнитель Из АльтернативныеИсполнители Цикл
			
			ВывестиИсполнителя(
				ТабличныйДокумент,
				ДанныеЭтапа,
				АльтернативныйИсполнитель,
				Исполнители,
				ГрафикИсполнителей,
				МакетОформления,
				РасшифровкиАльтернатив);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиЗаголовокИсполнитель(ТабличныйДокумент, Исполнитель, Исполнители, МакетОформления, РасшифровкиАльтернатив)
	
	АльтернативныеИсполнители = АльтернативныеИсполнители(Исполнитель, Исполнители);
	
	ВыводитьИспользование = Исполнитель.Альтернативный
		ИЛИ (НЕ АльтернативныеИсполнители = Неопределено
		И НЕ АльтернативныеИсполнители.Количество() = 0);
	
	Если ВыводитьИспользование Тогда
		
		Если НЕ Исполнитель.Альтернативный Тогда
			
			ОбластьИсполнитель = МакетОформления.ПолучитьОбласть("Исполнитель_Исполнитель");
			ОбластьИспользование = МакетОформления.ПолучитьОбласть("Исполнитель_Использование");
			ОбластьТребуется = МакетОформления.ПолучитьОбласть("Исполнитель_Требуется");
			
		Иначе
			
			ОбластьИсполнитель = МакетОформления.ПолучитьОбласть("ИсполнительАльтернативный_Исполнитель");
			ОбластьИспользование = МакетОформления.ПолучитьОбласть("ИсполнительАльтернативный_Использование");
			ОбластьТребуется = МакетОформления.ПолучитьОбласть("ИсполнительАльтернативный_Требуется");
		
		КонецЕсли;
		
	Иначе
		
		ОбластьИсполнитель = МакетОформления.ПолучитьОбласть("Исполнитель");
		ОбластьТребуется = ОбластьИсполнитель;
		
	КонецЕсли;
	
	ОбластьИсполнитель.Параметры.Исполнитель = Исполнитель.ВидРабочегоЦентра;
	ВремяВСекундах = ПолучитьВремяВСекундах(Исполнитель.ВремяРаботы, Исполнитель.ЕдиницаИзмерения);
	ОбластьТребуется.Параметры.Требуется = ПолучитьВремяСтрокой(ВремяВСекундах);
	
	Если ВыводитьИспользование Тогда
		
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
		
		Если НЕ Исполнитель.Альтернативный Тогда
			ОбластьИспользование.Области.Исполнитель_Использование.Текст = НСтр("ru = 'показать альтернативы'");
			ОбластьИспользование.Области.Исполнитель_Использование.Гиперссылка = Истина;
			ОбластьИспользование.Области.Исполнитель_Использование.Шрифт = Новый Шрифт(,,,, Истина);
		Иначе
			ОбластьИспользование.Области.ИсполнительАльтернативный_Использование.Текст = НСтр("ru = 'использовать'");
			ОбластьИспользование.Области.ИсполнительАльтернативный_Использование.Гиперссылка = Истина;
			ОбластьИспользование.Области.ИсполнительАльтернативный_Использование.Шрифт = Новый Шрифт(,,,, Истина);
		КонецЕсли;
		
		ДобавленнаяОбласть = ТабличныйДокумент.Присоединить(ОбластьИспользование);
		
		Если НЕ Исполнитель.Альтернативный Тогда
			РасшифровкаИсполнитель = Новый Структура;
			РасшифровкаИсполнитель.Вставить("ВидОбласти", "УправлениеВидимостьюАльтернативныхВидовРЦ");
			РасшифровкаИсполнитель.Вставить("ВидРабочегоЦентра", Исполнитель.ВидРабочегоЦентра);
			РасшифровкаИсполнитель.Вставить("КлючСвязи", Исполнитель.КлючСвязи);
			РасшифровкаИсполнитель.Вставить("КоличествоАльтернатив", АльтернативныеИсполнители.Количество());
			РасшифровкаИсполнитель.Вставить("ВысотаТаблицы", ТабличныйДокумент.ВысотаТаблицы);
			РасшифровкаИсполнитель.Вставить("Лево", ДобавленнаяОбласть.Лево);
			РасшифровкаИсполнитель.Вставить("Верх", ДобавленнаяОбласть.Верх);
			ДобавленнаяОбласть.Расшифровка = РасшифровкаИсполнитель;
			
			РасшифровкиАльтернатив.Добавить(РасшифровкаИсполнитель);
		Иначе
			РасшифровкаАльтернативныйИсполнитель = Новый Структура;
			РасшифровкаАльтернативныйИсполнитель.Вставить("ВидОбласти", "ИспользоватьВидРЦ");
			РасшифровкаАльтернативныйИсполнитель.Вставить("ВидРабочегоЦентра", Исполнитель.ВидРабочегоЦентра);
			РасшифровкаАльтернативныйИсполнитель.Вставить("КлючСвязи", Исполнитель.КлючСвязи);
			ДобавленнаяОбласть.Расшифровка = РасшифровкаАльтернативныйИсполнитель;
		КонецЕсли;
		
		ДобавленнаяОбласть = ТабличныйДокумент.Присоединить(ОбластьТребуется);
		
	Иначе
		
		ТабличныйДокумент.Вывести(ОбластьИсполнитель);
		
	КонецЕсли;
	
КонецПроцедуры

Функция АльтернативныеИсполнители(Исполнитель, Исполнители)
	
	Если НЕ Исполнитель.Альтернативный Тогда
		СтруктураПоиска = Новый Структура("КлючСвязи, Альтернативный", Исполнитель.КлючСвязи, Истина);
		Результат = Исполнители.НайтиСтроки(СтруктураПоиска);
	Иначе
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ВывестиДоступностьИсполнительСОграничениями(ТабличныйДокумент, ДанныеЭтапа, Исполнитель, ГрафикИсполнителей, МакетОформления)
	
	ОбластьИсполнитель = МакетОформления.ПолучитьОбласть("ИсполнительДанные");
	Оформления = ОформленияИсполнители(МакетОформления);
	
	СтруктураПоиска = Новый Структура("ВидРабочегоЦентра, ДатаИнтервала", Исполнитель.ВидРабочегоЦентра);
	ПустыеЗначения = Новый Структура("ОбщаяДоступность, ДоступноДляТекущего, ЗанятоТекущим", "", "", "");
	
	ДатаИнтервала = ДанныеЭтапа.ПолныйИнтервалНачало;
	Пока ДатаИнтервала < ДанныеЭтапа.ПолныйИнтервалОкончание Цикл
		
		СтруктураПоиска.ДатаИнтервала = ДатаИнтервала;
		НайденныеСтроки = ГрафикИсполнителей.ДоступностьВРЦ.НайтиСтроки(СтруктураПоиска);
		
		ИнтервалЗанят = Ложь;
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			ЗаполнитьЗначенияСвойств(ОбластьИсполнитель.Параметры, ПустыеЗначения);
			Оформление = Оформления.ИнтервалНедоступен;
			
		Иначе
			
			ЗначенияЗаполнения = НайденныеСтроки[0];
			
			Если ЗначенияЗаполнения.РезервОбщий > 0 Тогда
				
				ДоступноБезРезерва = ЗначенияЗаполнения.ОбщаяДоступность - ЗначенияЗаполнения.РезервОбщий;
				ОбщаяДоступность = ПолучитьВремяСтрокой(ДоступноБезРезерва)
					+ " (+"
					+ ПолучитьВремяСтрокой(ЗначенияЗаполнения.РезервОбщий)
					+ ")";
				
			Иначе
				ОбщаяДоступность = ПолучитьВремяСтрокой(ЗначенияЗаполнения.ОбщаяДоступность);
			КонецЕсли;
			
			Если ЗначенияЗаполнения.РезервДоступноДляТекущего > 0 Тогда
				
				ДоступноДляТекущегоБезРезерва = ЗначенияЗаполнения.ДоступноДляТекущегоСРезервом
					- ЗначенияЗаполнения.РезервДоступноДляТекущего;
				ДоступноДляТекущего = ПолучитьВремяСтрокой(ДоступноДляТекущегоБезРезерва)
					+ " (+"
					+ ПолучитьВремяСтрокой(ЗначенияЗаполнения.РезервДоступноДляТекущего)
					+ ")";
					
			Иначе
				ДоступноДляТекущего = ПолучитьВремяСтрокой(ЗначенияЗаполнения.ДоступноДляТекущегоСРезервом);
			КонецЕсли;
			
			ОбластьИсполнитель.Параметры.ОбщаяДоступность = ОбщаяДоступность;
			ОбластьИсполнитель.Параметры.ДоступноДляТекущего = ДоступноДляТекущего;
			ОбластьИсполнитель.Параметры.ЗанятоТекущим = ПолучитьВремяСтрокой(ЗначенияЗаполнения.ЗанятоТекущим);
			
			Если ЗначенияЗаполнения.СвободноСРезервом < 0 Тогда
				Оформление = Оформления.ИнтервалПерегружен;
			ИначеЕсли ЗначенияЗаполнения.ЗанятоТекущим > 0 Тогда
				Оформление = Оформления.ИнтервалЗанятДиагностируемымЭтапом;
			ИначеЕсли ЗначенияЗаполнения.ЗанятоПрочими > 0 И ЗначенияЗаполнения.СвободноСРезервом = 0 Тогда
				Оформление = Оформления.ИнтервалЗанят;
			ИначеЕсли ЗначенияЗаполнения.ЗанятоПрочими > 0 Тогда
				Оформление = Оформления.ИнтервалЧастичноДоступен;
			ИначеЕсли ЗначенияЗаполнения.ОбщаяДоступность = 0 Тогда
				Оформление = Оформления.ИнтервалНедоступен;
			Иначе
				Оформление = Оформления.ИнтервалДоступен;
			КонецЕсли;
			
			Если ЗначенияЗаполнения.ЗанятоТекущим > 0 Тогда
				ИнтервалЗанят = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		УстановитьОформлениеОбласти(ОбластьИсполнитель.Области.ИсполнительДанные, Оформление);
		
		ДобавленнаяОбласть = ТабличныйДокумент.Присоединить(ОбластьИсполнитель);
		
		Если ИнтервалЗанят Тогда
			ЗаполнитьГраницыЭтапа(ДанныеЭтапа, ДобавленнаяОбласть);
		КонецЕсли;
		
		ДатаИнтервала = ПривестиКОкончаниюИнтервалаПланирования(ДанныеЭтапа, ДатаИнтервала);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиДоступностьИсполнительБезОграничений(ТабличныйДокумент, ДанныеЭтапа, Исполнитель, ГрафикИсполнителей, МакетОформления)
	
	ОбластьИсполнительНетДоступности = МакетОформления.ПолучитьОбласть("ИсполнительДанные");
	ОбластьИсполнительЕстьДоступность = МакетОформления.ПолучитьОбласть("ИсполнительДанныеБезОграниченияДоступности");
	Оформления = ОформленияИсполнители(МакетОформления);
		
	Доступность = ГрафикИсполнителей.РасписаниеББВ;
	СтруктураПоискаДоступность = Новый Структура("ГрафикРаботы, ИнтервалПланирования, ДатаИнтервала");
	ЗаполнитьЗначенияСвойств(СтруктураПоискаДоступность, Исполнитель);
	
	Загрузка = ГрафикИсполнителей.ЗагрузкаВРЦБезОграничений;
	СтруктураПоискаЗагрузка = Новый Структура("ВидРабочегоЦентра, ДатаИнтервала");
	ЗаполнитьЗначенияСвойств(СтруктураПоискаЗагрузка, Исполнитель);
	
	ПустыеЗначения = Новый Структура("ЗанятоТекущим", "");
	
	ДатаИнтервала = ДанныеЭтапа.ПолныйИнтервалНачало;
	Пока ДатаИнтервала < ДанныеЭтапа.ПолныйИнтервалОкончание Цикл
		
		СтруктураПоискаДоступность.ДатаИнтервала = ДатаИнтервала;
		НайденныеСтроки = Доступность.НайтиСтроки(СтруктураПоискаДоступность);
		
		ИнтервалЗанят = Ложь;
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			ОбластьИсполнитель = ОбластьИсполнительНетДоступности;
			УстановитьОформлениеОбласти(
				ОбластьИсполнитель.Области.ИсполнительДанные,
				Оформления.ИнтервалНедоступен);
			
		Иначе
			
			ОбластьИсполнитель = ОбластьИсполнительЕстьДоступность;
			
			СтруктураПоискаЗагрузка.ДатаИнтервала = ДатаИнтервала;
			НайденныеСтрокиЗагрузка = Загрузка.НайтиСтроки(СтруктураПоискаЗагрузка);
			
			Если НайденныеСтрокиЗагрузка.Количество() = 0 Тогда
				
				ЗаполнитьЗначенияСвойств(ОбластьИсполнитель.Параметры, ПустыеЗначения);
				Оформление = Оформления.ИнтервалДоступен;
				
			Иначе
				
				ЗначенияЗаполнения = НайденныеСтрокиЗагрузка[0];
				ОбластьИсполнитель.Параметры.ЗанятоТекущим = ПолучитьВремяСтрокой(ЗначенияЗаполнения.ЗанятоТекущим);
				
				Если ЗначенияЗаполнения.ЗанятоТекущим > 0 Тогда
					Оформление = Оформления.ИнтервалЗанятДиагностируемымЭтапом;
					ИнтервалЗанят = Истина;
				Иначе
					Оформление = Оформления.ИнтервалДоступен;
				КонецЕсли;
				
			КонецЕсли;
			
			УстановитьОформлениеОбласти(
				ОбластьИсполнитель.Области.ИсполнительДанныеБезОграниченияДоступности,
				Оформление);
			
		КонецЕсли;
		
		ДобавленнаяОбласть = ТабличныйДокумент.Присоединить(ОбластьИсполнитель);
		
		Если ИнтервалЗанят Тогда
			ЗаполнитьГраницыЭтапа(ДанныеЭтапа, ДобавленнаяОбласть);
		КонецЕсли;
		
		ДатаИнтервала = ПривестиКОкончаниюИнтервалаПланирования(ДанныеЭтапа, ДатаИнтервала);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ОформленияИсполнители(МакетОформления)
	
	Результат = Новый Структура;
	
	Результат.Вставить("ИнтервалЗанятДиагностируемымЭтапом",
		МакетОформления.ПолучитьОбласть("ИнтервалЗанятДиагностируемымЭтапом").Области.ИнтервалЗанятДиагностируемымЭтапом);
		
	Результат.Вставить("ИнтервалЗанят",
		МакетОформления.ПолучитьОбласть("ИнтервалЗанят").Области.ИнтервалЗанят);
	
	Результат.Вставить("ИнтервалНедоступен",
		МакетОформления.ПолучитьОбласть("ИнтервалНедоступен").Области.ИнтервалНедоступен);
	
	Результат.Вставить("ИнтервалДоступен",
		МакетОформления.ПолучитьОбласть("ИнтервалДоступен").Области.ИнтервалДоступен);
	
	Результат.Вставить("ИнтервалЧастичноДоступен",
		МакетОформления.ПолучитьОбласть("ИнтервалЧастичноДоступен").Области.ИнтервалЧастичноДоступен);
	
	Результат.Вставить("ИнтервалПерегружен",
		МакетОформления.ПолучитьОбласть("ИнтервалПерегружен").Области.ИнтервалПерегружен);
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьГраницыЭтапа(ДанныеЭтапа, ДобавленнаяОбласть)
	
	Если ЗначениеЗаполнено(ДанныеЭтапа.ЛеваяГраницаЭтапа) Тогда
		
		ДанныеЭтапа.ЛеваяГраницаЭтапа = Мин(
			ДанныеЭтапа.ЛеваяГраницаЭтапа,
			ДобавленнаяОбласть.Лево);
			
	Иначе
		
		ДанныеЭтапа.ЛеваяГраницаЭтапа = ДобавленнаяОбласть.Лево;
		
	КонецЕсли;
	
	ДанныеЭтапа.ПраваяГраницаЭтапа = Макс(
		ДанныеЭтапа.ПраваяГраницаЭтапа,
		ДобавленнаяОбласть.Право);
	
КонецПроцедуры

#КонецОбласти

#Область Материалы

Процедура ВывестиМатериалы(ТабличныйДокумент, ДанныеЭтапа, МакетОформления)
	
	Материалы = МатериалыЭтапа(ДанныеЭтапа);
	Если Материалы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьЗаголовок = МакетОформления.ПолучитьОбласть("МатериалыЗаголовок");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	Оформления = ОформленияИсполнители(МакетОформления);
	
	ОбластьМатериал       = МакетОформления.ПолучитьОбласть("Материал");
	ОбластьМатериалДанные = МакетОформления.ПолучитьОбласть("МатериалДанные");
	
	Для каждого Строка Из Материалы Цикл
		
		ОбластьМатериал.Параметры.Материал            = ПредставлениеМатериала(Строка);
		ОбластьМатериал.Параметры.РасшифровкаМатериал = Строка.Номенклатура;
		ОбластьМатериал.Параметры.Требуется           = Строка.Количество;
		
		ТабличныйДокумент.Вывести(ОбластьМатериал);
		
		Начало = ДанныеЭтапа.ПолныйИнтервалНачало;
		Пока Начало < ДанныеЭтапа.ПолныйИнтервалОкончание Цикл
			
			Если Начало < Строка.ДатаОбеспечения Тогда
				
				УстановитьОформлениеОбласти(ОбластьМатериалДанные.Области.МатериалДанные, Оформления.ИнтервалЗанят);
				
			Иначе
				
				УстановитьОформлениеОбласти(ОбластьМатериалДанные.Области.МатериалДанные, Оформления.ИнтервалДоступен);
				
			КонецЕсли;
			
			ДобавленнаяОбласть = ТабличныйДокумент.Присоединить(ОбластьМатериалДанные);
			
			Начало = ПривестиКОкончаниюИнтервалаПланирования(ДанныеЭтапа, Начало);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция МатериалыЭтапа(ДанныеЭтапа)
	
	МассивЭтапов = Новый Массив;
	МассивЭтапов.Добавить(ДанныеЭтапа.ЭтапПроизводства);
	ДатыОбеспечения = Документы.ЭтапПроизводства2_2.ДатыОбеспеченияЭтапов(МассивЭтапов, Истина);
	
	Если ДатыОбеспечения.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДатыОбеспечения.ЭтапПроизводства,
	|	ДатыОбеспечения.Номенклатура,
	|	ДатыОбеспечения.Характеристика,
	|	ДатыОбеспечения.Склад,
	|	ДатыОбеспечения.ВариантОбеспечения,
	|	ДатыОбеспечения.ДатаОбеспечения
	|ПОМЕСТИТЬ ДатыОбеспечения
	|ИЗ
	|	&ДатыОбеспечения КАК ДатыОбеспечения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Материалы.Номенклатура КАК Номенклатура,
	|	Материалы.Номенклатура.Представление КАК НоменклатураПредставление,
	|	Материалы.Характеристика КАК Характеристика,
	|	Материалы.Характеристика.Представление КАК ХарактеристикаПредставление,
	|	&ТекстЗапросаЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	&ТекстЗапросаПредставлениеЕдиницыИзмерения КАК ЕдиницаИзмеренияПредставление,
	|	СУММА(ВЫБОР
	|			КОГДА &ВыводитьБазовыеЕдиницыИзмерения
	|				ТОГДА Материалы.Количество
	|			ИНАЧЕ Материалы.КоличествоУпаковок
	|		КОНЕЦ) КАК Количество,
	|	МАКСИМУМ(ДатыОбеспечения.ДатаОбеспечения) КАК ДатаОбеспечения
	|ИЗ
	|	ДатыОбеспечения КАК ДатыОбеспечения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК Материалы
	|		ПО ДатыОбеспечения.ЭтапПроизводства = Материалы.Ссылка
	|			И ДатыОбеспечения.Номенклатура = Материалы.Номенклатура
	|			И ДатыОбеспечения.Характеристика = Материалы.Характеристика
	|			И ДатыОбеспечения.Склад = Материалы.Склад
	|			И ДатыОбеспечения.ВариантОбеспечения = Материалы.ВариантОбеспечения
	|
	|СГРУППИРОВАТЬ ПО
	|	Материалы.Номенклатура,
	|	Материалы.Характеристика,
	|	Материалы.Номенклатура.Представление,
	|	Материалы.Характеристика.Представление,
	|	&ТекстЗапросаЕдиницаИзмерения,
	|	&ТекстЗапросаПредставлениеЕдиницыИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаОбеспечения УБЫВ,
	|	Номенклатура");
	
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст,
		"&ТекстЗапросаЕдиницаИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Ссылка",
			"Материалы.Упаковка",
			"Материалы.Номенклатура"));
			
	Запрос.Текст = СтрЗаменить(
		Запрос.Текст,
		"&ТекстЗапросаПредставлениеЕдиницыИзмерения",
		Справочники.УпаковкиЕдиницыИзмерения.ТекстЗапросаЗначениеРеквизитаЕдиницыИзмерения(
			"Наименование",
			"Материалы.Упаковка",
			"Материалы.Номенклатура"));
	
	Запрос.УстановитьПараметр("ДатыОбеспечения", ДатыОбеспечения);
	Запрос.УстановитьПараметр("ВыводитьБазовыеЕдиницыИзмерения",
		Константы.ВыводитьБазовыеЕдиницыИзмерения.Получить());
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПредставлениеМатериала(ЗначенияЗаполнения)
	
	Результат = ЗначенияЗаполнения.НоменклатураПредставление;
	
	Если ЗначениеЗаполнено(ЗначенияЗаполнения.ХарактеристикаПредставление) Тогда
		Результат = Результат + ", " + ЗначенияЗаполнения.ХарактеристикаПредставление;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗначенияЗаполнения.ЕдиницаИзмеренияПредставление) Тогда
		Результат = Результат + ", " + ЗначенияЗаполнения.ЕдиницаИзмеренияПредставление;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрочиеОграничения

Процедура ВывестиЛевуюГраницу(ТабличныйДокумент, ДанныеЭтапа, МакетОформления)
	
	Если Не ЗначениеЗаполнено(ДанныеЭтапа.ПланироватьНеРанее) Тогда
		Возврат;
	КонецЕсли;
	
	ОбластьЗаголовок = МакетОформления.ПолучитьОбласть("ПланироватьНеРанее");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
	ФорматДатыГрафика = УправлениеПроизводством.ФорматнаяСтрокаДляДатыГрафикаПроизводства();
	ТекстПланироватьНеРанее = Формат(ДанныеЭтапа.ПланироватьНеРанее, ФорматДатыГрафика);
	
	ОбластьЭтап = МакетОформления.ПолучитьОбласть("Этап");
	ОбластьЭтап.Параметры.ЭтапПроизводства   = ДанныеЭтапа.ЭтапПроизводства;
	ОбластьЭтап.Параметры.ПредставлениеЭтапа = ТекстПланироватьНеРанее;
	ТабличныйДокумент.Вывести(ОбластьЭтап);
	
	Оформления = ОформленияИсполнители(МакетОформления);
	ОбластьЭтапДанные = МакетОформления.ПолучитьОбласть("ЭтапДанные");
	
	Начало = ДанныеЭтапа.ПолныйИнтервалНачало;
	Пока Начало < ДанныеЭтапа.ПолныйИнтервалОкончание Цикл
		
		Если Начало < ДанныеЭтапа.ПланироватьНеРанее Тогда
			УстановитьОформлениеОбласти(ОбластьЭтапДанные.Области.ЭтапДанные, Оформления.ИнтервалЗанят);
		Иначе
			УстановитьОформлениеОбласти(ОбластьЭтапДанные.Области.ЭтапДанные, Оформления.ИнтервалДоступен);
		КонецЕсли;
		
		ДобавленнаяОбласть = ТабличныйДокумент.Присоединить(ОбластьЭтапДанные);
		Начало = ПривестиКОкончаниюИнтервалаПланирования(ДанныеЭтапа, Начало);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

Функция ДанныеЭтапа(ЭтапПроизводства, СтатусГрафика)
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ГрафикПроизводства.Распоряжение КАК Распоряжение,
		|	ГрафикПроизводства.ЭтапПроизводства КАК ЭтапПроизводства,
		|	&ПредставлениеЭтапа КАК ПредставлениеЭтапа,
		|	ГрафикПроизводства.ЭтапПроизводства.Подразделение КАК Подразделение,
		|	ГрафикПроизводства.ЭтапПроизводства.Подразделение.ИнтервалПланирования КАК ИнтервалПланирования,
		|	ГрафикПроизводства.ЭтапПроизводства.ПланироватьНеРанее КАК ПланироватьНеРанее,
		|	ГрафикПроизводства.НачалоЭтапа КАК НачалоЭтапа,
		|	ГрафикПроизводства.ОкончаниеЭтапа КАК ОкончаниеЭтапа,
		|	ГрафикПроизводства.ЭтапПроизводства.НаименованиеЭтапа КАК НаименованиеЭтапа,
		|	ГрафикПроизводства.ЭтапПроизводства.Номер КАК НомерЭтапа,
		|	ГрафикПроизводства.ЭтапПроизводства.ПланироватьРаботуВидовРабочихЦентров КАК ПланироватьРаботуВидовРабочихЦентров,
		|	ГрафикПроизводства.ЭтапПроизводства.ПроизводствоНаСтороне КАК ПроизводствоНаСтороне,
		|	ВЫБОР
		|		КОГДА ГрафикПроизводства.ЭтапПроизводства.ПроизводствоНаСтороне
		|			ТОГДА ОсновнойКалендарьПредприятия.Значение
		|		ИНАЧЕ ВЫБОР
		|				КОГДА ГрафикПроизводства.ЭтапПроизводства.Подразделение.ГрафикРаботы = ЗНАЧЕНИЕ(Справочник.Календари.ПустаяСсылка)
		|					ТОГДА ОсновнойКалендарьПредприятия.Значение
		|				ИНАЧЕ ГрафикПроизводства.ЭтапПроизводства.Подразделение.ГрафикРаботы
		|			КОНЕЦ
		|	КОНЕЦ КАК ГрафикРаботы,
		|	ГрафикПроизводства.Распоряжение.Очередь КАК Очередь,
		|	ГрафикПроизводства.Распоряжение.Приоритет.РеквизитДопУпорядочивания КАК ПриоритетНомер,
		|	ГрафикПроизводства.Распоряжение.Подразделение.РеквизитДопУпорядочивания КАК ПодразделениеНомер,
		|	ГрафикПроизводства.ЭтапПроизводства.ДлительностьЭтапа КАК ДлительностьЭтапа,
		|	ВЫБОР
		|		КОГДА ГрафикПроизводства.ЭтапПроизводства.ЕдиницаИзмеренияДлительностиЭтапа = ЗНАЧЕНИЕ(Перечисление.ЕдиницыИзмеренияВремени.ПустаяСсылка)
		|			ТОГДА &ОсновнаяЕдиницаВремениДлительностиЭтапаУББВ
		|		ИНАЧЕ ГрафикПроизводства.ЭтапПроизводства.ЕдиницаИзмеренияДлительностиЭтапа
		|	КОНЕЦ КАК ЕдиницаИзмеренияДлительностиЭтапа,
		|	ВЫБОР
		|		КОГДА ГрафикПроизводства.РазмещениеВыпуска = ЗНАЧЕНИЕ(Перечисление.СпособыПривязкиОперацийПроизводства.КНачалу)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РазмещениеКНачалу,
		|	&СтатусГрафика КАК СтатусГрафика
		|ИЗ
		|	РегистрСведений.ГрафикЭтаповПроизводства2_2 КАК ГрафикПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НормативныйГрафикЭтаповПроизводства КАК НормативныйГрафик
		|		ПО ГрафикПроизводства.ЭтапПроизводства = НормативныйГрафик.ЭтапПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.ОсновнойКалендарьПредприятия КАК ОсновнойКалендарьПредприятия
		|		ПО (ИСТИНА)
		|ГДЕ
		|	ГрафикПроизводства.ЭтапПроизводства = &ЭтапПроизводства
		|	И ГрафикПроизводства.СтатусГрафика = &СтатусГрафика";
		
	ТекстЗапроса = СтрЗаменить(
		ТекстЗапроса,
		"&ПредставлениеЭтапа",
		Документы.ЭтапПроизводства2_2.ТекстЗапросаПредставлениеЭтапа("ГрафикПроизводства.ЭтапПроизводства"));
		
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЭтапПроизводства", ЭтапПроизводства);
	Запрос.УстановитьПараметр("СтатусГрафика", СтатусГрафика);
	Запрос.УстановитьПараметр("ОсновнаяЕдиницаВремениДлительностиЭтапаУББВ",
		Справочники.ЭтапыПроизводства.ОсновнаяЕдиницаВремениДлительностиЭтапаУББВ());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() = 1 Тогда
		
		ЗначенияЗаполнения = РезультатЗапроса[0];
		
		Результат = Новый Структура;
		Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
			Результат.Вставить(Колонка.Имя, ЗначенияЗаполнения[Колонка.Имя]);
		КонецЦикла;
		
		Если ЭтоЭтапУББВ(Результат) Тогда
			
			Результат.ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.День;
			
		КонецЕсли;
		
		Результат.Вставить("ПолныйИнтервалНачало", '00010101');
		Результат.Вставить("ПолныйИнтервалОкончание", '00010101');
		
		Результат.Вставить("ЛеваяГраницаЭтапа", 0);
		Результат.Вставить("ПраваяГраницаЭтапа", 0);
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ВывестиШапку(ТабличныйДокумент, ДанныеЭтапа, МакетОформления)
	
	Начало = ДанныеЭтапа.НачалоЭтапа;
	Окончание = ДанныеЭтапа.ОкончаниеЭтапа;
	
	ИнтервалПланирования = ДанныеЭтапа.ИнтервалПланирования;
	Если ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Час Тогда
		
		ОбластьИнтервал = МакетОформления.ПолучитьОбласть("ИнтервалЧас");
		ОбластьИнтервалЗаголовок = МакетОформления.ПолучитьОбласть("ИнтервалЧасЗаголовок");
		
		СтруктураПараметры = Новый Структура("ЧасНачалоДня");
		
		ПолныйИнтервалНачало = НачалоДня(Начало) - 86400;
		ПолныйИнтервалОкончание = КонецДня(Окончание) + 86400;
		
	ИначеЕсли ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.День Тогда
		
		ОбластьИнтервал = МакетОформления.ПолучитьОбласть("ИнтервалДень");
		ОбластьИнтервалЗаголовок = МакетОформления.ПолучитьОбласть("ИнтервалДеньЗаголовок");
		
		СтруктураПараметры = Новый Структура("ДеньНачалоНедели, ДеньПонедельник, ДеньВторник,
			|ДеньСреда, ДеньЧетверг, ДеньПятница, ДеньСуббота, ДеньВоскресенье");
		
		ПолныйИнтервалНачало = НачалоНедели(Начало) - (86400 * 7);
		ПолныйИнтервалОкончание = КонецНедели(Окончание) + (86400 * 7);
		
	ИначеЕсли ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Неделя Тогда
		
		ОбластьИнтервал = МакетОформления.ПолучитьОбласть("ИнтервалНеделя");
		ОбластьИнтервалЗаголовок = МакетОформления.ПолучитьОбласть("ИнтервалНеделяЗаголовок");
		
		СтруктураПараметры = Новый Структура("ДеньНачалоНедели");
		
		ПолныйИнтервалНачало = НачалоНедели(Начало) - (86400 * 7);
		ПолныйИнтервалОкончание = КонецНедели(Окончание) + (86400 * 7);
		
	ИначеЕсли ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Месяц Тогда
		
		ОбластьИнтервал = МакетОформления.ПолучитьОбласть("ИнтервалМесяц");
		ОбластьИнтервалЗаголовок = МакетОформления.ПолучитьОбласть("ИнтервалМесяцЗаголовок");
		
		СтруктураПараметры = Новый Структура("ДеньНачалоМесяца");
		
		ПолныйИнтервалНачало = НачалоМесяца(НачалоМесяца(Начало) - 1);
		ПолныйИнтервалОкончание = КонецМесяца(КонецМесяца(Окончание) + 1);
		
	КонецЕсли;
	
	ОбластьИнтервалЗаголовок.Параметры.ЭтапПроизводства = ДанныеЭтапа.ЭтапПроизводства;
	ОбластьИнтервалЗаголовок.Параметры.ПредставлениеЭтапа = ДанныеЭтапа.ПредставлениеЭтапа;
	
	ТабличныйДокумент.Вывести(ОбластьИнтервалЗаголовок);
	
	ТекущийИнтервал = ПолныйИнтервалНачало;
	
	Пока ТекущийИнтервал < ПолныйИнтервалОкончание Цикл
		
		Если ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Час Тогда
			
			Если НачалоЧаса(ТекущийИнтервал) = НачалоДня(ТекущийИнтервал) Тогда
				
				СтруктураПараметры.ЧасНачалоДня = ТекущийИнтервал;
				
			КонецЕсли;
			
			Если КонецЧаса(ТекущийИнтервал) = КонецДня(ТекущийИнтервал) Тогда
				
				ОбластьИнтервал.Параметры.Заполнить(СтруктураПараметры);
				ТабличныйДокумент.Присоединить(ОбластьИнтервал);
				
			КонецЕсли;
			
			ТекущийИнтервал = КонецЧаса(ТекущийИнтервал) + 1;
			
		ИначеЕсли ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.День Тогда
			
			Если НачалоДня(ТекущийИнтервал) = НачалоНедели(ТекущийИнтервал) Тогда
				
				СтруктураПараметры.ДеньНачалоНедели = ТекущийИнтервал;
				
			КонецЕсли;
			
			ЭтоТекущийДень = ТекущийИнтервал = НачалоДня(ТекущаяДатаСеанса());
			
			Если ДеньНедели(ТекущийИнтервал) = 1 Тогда
				
				СтруктураПараметры.ДеньПонедельник = ТекущийИнтервал;
				ОбластьИнтервал.Области.ДеньПонедельник.Шрифт = Новый Шрифт(
					ОбластьИнтервал.Области.ДеньПонедельник.Шрифт,,, ЭтоТекущийДень);
				
			ИначеЕсли ДеньНедели(ТекущийИнтервал) = 2 Тогда
				
				СтруктураПараметры.ДеньВторник = ТекущийИнтервал;
				ОбластьИнтервал.Области.ДеньВторник.Шрифт = Новый Шрифт(
					ОбластьИнтервал.Области.ДеньВторник.Шрифт,,, ЭтоТекущийДень);
				
			ИначеЕсли ДеньНедели(ТекущийИнтервал) = 3 Тогда
				
				СтруктураПараметры.ДеньСреда = ТекущийИнтервал;
				ОбластьИнтервал.Области.ДеньСреда.Шрифт = Новый Шрифт(
					ОбластьИнтервал.Области.ДеньСреда.Шрифт,,, ЭтоТекущийДень);
				
			ИначеЕсли ДеньНедели(ТекущийИнтервал) = 4 Тогда
				
				СтруктураПараметры.ДеньЧетверг = ТекущийИнтервал;
				ОбластьИнтервал.Области.ДеньЧетверг.Шрифт = Новый Шрифт(
					ОбластьИнтервал.Области.ДеньЧетверг.Шрифт,,, ЭтоТекущийДень);
				
			ИначеЕсли ДеньНедели(ТекущийИнтервал) = 5 Тогда
				
				СтруктураПараметры.ДеньПятница = ТекущийИнтервал;
				ОбластьИнтервал.Области.ДеньПятница.Шрифт = Новый Шрифт(
					ОбластьИнтервал.Области.ДеньПятница.Шрифт,,, ЭтоТекущийДень);
				
			ИначеЕсли ДеньНедели(ТекущийИнтервал) = 6 Тогда
				
				СтруктураПараметры.ДеньСуббота = ТекущийИнтервал;
				ОбластьИнтервал.Области.ДеньСуббота.Шрифт = Новый Шрифт(
					ОбластьИнтервал.Области.ДеньСуббота.Шрифт,,, ЭтоТекущийДень);
				
			ИначеЕсли ДеньНедели(ТекущийИнтервал) = 7 Тогда
				
				СтруктураПараметры.ДеньВоскресенье = ТекущийИнтервал;
				ОбластьИнтервал.Области.ДеньВоскресенье.Шрифт = Новый Шрифт(
					ОбластьИнтервал.Области.ДеньВоскресенье.Шрифт,,, ЭтоТекущийДень);
				
			КонецЕсли;
			
			Если КонецДня(ТекущийИнтервал) = КонецНедели(ТекущийИнтервал) Тогда
				
				ОбластьИнтервал.Параметры.Заполнить(СтруктураПараметры);
				ТабличныйДокумент.Присоединить(ОбластьИнтервал);
				
			КонецЕсли;
			
			ТекущийИнтервал = КонецДня(ТекущийИнтервал) + 1;
			
		ИначеЕсли ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Неделя Тогда
			
			СтруктураПараметры.ДеньНачалоНедели = ТекущийИнтервал;
			
			ОбластьИнтервал.Параметры.Заполнить(СтруктураПараметры);
			ТабличныйДокумент.Присоединить(ОбластьИнтервал);
			
			ТекущийИнтервал = КонецНедели(ТекущийИнтервал) + 1;
			
		ИначеЕсли ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Месяц Тогда
			
			СтруктураПараметры.ДеньНачалоМесяца = ТекущийИнтервал;
			
			ОбластьИнтервал.Параметры.Заполнить(СтруктураПараметры);
			ТабличныйДокумент.Присоединить(ОбластьИнтервал);
			
			ТекущийИнтервал = КонецМесяца(ТекущийИнтервал) + 1;
			
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТабличныйДокумент.ФиксацияСверху = ОбластьИнтервал.ВысотаТаблицы;
	ТабличныйДокумент.ФиксацияСлева  = ОбластьИнтервалЗаголовок.ШиринаТаблицы;
	
	ДанныеЭтапа.ПолныйИнтервалНачало = ПолныйИнтервалНачало;
	ДанныеЭтапа.ПолныйИнтервалОкончание = ПолныйИнтервалОкончание;
	
КонецПроцедуры

Процедура УстановитьОформлениеОбласти(Приемник, Источник)
	
	Приемник.ЦветФона   = Источник.ЦветФона;
	Приемник.ЦветТекста = Источник.ЦветТекста;
	Приемник.ЦветУзора  = Источник.ЦветУзора;
	Приемник.Узор       = Источник.Узор;
	
КонецПроцедуры

Функция СтатусРабочийГрафик()
	
	Возврат РегистрыСведений.ГрафикЭтаповПроизводства2_2.СтатусРабочийГрафик();
	
КонецФункции

Функция ПривестиКОкончаниюИнтервалаПланирования(ДанныеЭтапа, Дата)
	
	Если ДанныеЭтапа.ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.День Тогда
		Результат = КонецДня(Дата) + 1;
	ИначеЕсли ДанныеЭтапа.ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Неделя Тогда
		Результат = КонецНедели(Дата) + 1;
	ИначеЕсли ДанныеЭтапа.ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Месяц Тогда
		Результат = КонецМесяца(Дата) + 1;
	ИначеЕсли ДанныеЭтапа.ИнтервалПланирования = Перечисления.ТочностьГрафикаПроизводства.Час Тогда
		Результат = КонецЧаса(Дата) + 1;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоЭтапУББВ(ДанныеЭтапа)
	
	Возврат НЕ ДанныеЭтапа.ПланироватьРаботуВидовРабочихЦентров ИЛИ ДанныеЭтапа.ПроизводствоНаСтороне;
	
КонецФункции

Функция ПолучитьВремяВСекундах(ВремяРаботы, ЕдиницаИзмерения)
	
	Возврат ПланированиеПроизводстваКлиентСервер.ПолучитьВремяВСекундах(
		ВремяРаботы, ЕдиницаИзмерения);
	
КонецФункции

Функция ПолучитьВремяСтрокой(ВремяРаботы, ЕдиницаИзмерения = Неопределено)
	
	Возврат ПланированиеПроизводстваКлиентСервер.ПолучитьВремяСтрокой(
		ВремяРаботы, ЕдиницаИзмерения);
	
КонецФункции

Процедура ОбвестиГраницыЭтапа(ТабличныйДокумент, ДанныеЭтапа)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЭтапа.ЛеваяГраницаЭтапа)
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеЭтапа.ПраваяГраницаЭтапа) Тогда
		Возврат;
	КонецЕсли;
	
	Линия = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);
	ОбластьТекущийЭтап = ТабличныйДокумент.Область(
		4, 
		ДанныеЭтапа.ЛеваяГраницаЭтапа, 
		ТабличныйДокумент.ВысотаТаблицы, 
		ДанныеЭтапа.ПраваяГраницаЭтапа);
													
	ОбластьТекущийЭтап.Обвести(Линия, Линия, Линия, Линия);
	ОбластьТекущийЭтап.ЦветРамки = WebЦвета.СветлоЗеленый;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
